#+STARTUP: folded indent
#+PROPERTY: header-args:R :results output :session *R:forcats*

* ~{forcats}~: tools for working with categorical variables (factors)

R のファクター型 (因子型) を扱うための ~{tidyverse}~ パッケージ。

* ライブラリの読み込みとバージョンの確認

#+begin_src R :results silent
library(forcats)
#+end_src

- バージョン
#+begin_src R :exports both
packageVersion("forcats")
#+end_src

#+RESULTS:
: [1] ‘0.4.0’

* 全関数リスト

#+begin_src R :exports both
pacman::p_funs(forcats)
#+end_src

#+RESULTS:
:  [1] "%>%"             "as_factor"       "fct_anon"        "fct_c"          
:  [5] "fct_collapse"    "fct_count"       "fct_cross"       "fct_drop"       
:  [9] "fct_expand"      "fct_explicit_na" "fct_infreq"      "fct_inorder"    
: [13] "fct_inseq"       "fct_lump"        "fct_lump_min"    "fct_match"      
: [17] "fct_other"       "fct_recode"      "fct_relabel"     "fct_relevel"    
: [21] "fct_reorder"     "fct_reorder2"    "fct_rev"         "fct_shift"      
: [25] "fct_shuffle"     "fct_unify"       "fct_unique"      "last2"          
: [29] "lvls_expand"     "lvls_reorder"    "lvls_revalue"    "lvls_union"

* 関数リスト

- ~fct_~ prefix が付く
- ~fct_inorder()~ factor の順序を出現順にしたい
#+begin_src R
factor(x1, levels = unique(x1))
factor(x1) %>% fct_inorder()
#+end_src

#+RESULTS:
: [1] Dec Apr Jan Mar
: Levels: Dec Apr Jan Mar
: 
: [1] Dec Apr Jan Mar
: Levels: Dec Apr Jan Mar

- GSS 総合的社会調査データセット
#+begin_src R :results value :colnames yes
data(gss_cat)
head(gss_cat)
#+end_src

#+RESULTS:
| year | marital       | age | race  | rincome        | partyid            | relig              | denom            | tvhours |
|------+---------------+-----+-------+----------------+--------------------+--------------------+------------------+---------|
| 2000 | Never married |  26 | White | $8000 to 9999  | Ind,near rep       | Protestant         | Southern baptist |      12 |
| 2000 | Divorced      |  48 | White | $8000 to 9999  | Not str republican | Protestant         | Baptist-dk which |     nil |
| 2000 | Widowed       |  67 | White | Not applicable | Independent        | Protestant         | No denomination  |       2 |
| 2000 | Never married |  39 | White | Not applicable | Ind,near rep       | Orthodox-christian | Not applicable   |       4 |
| 2000 | Divorced      |  25 | White | Not applicable | Not str democrat   | None               | Not applicable   |       1 |
| 2000 | Married       |  25 | White | $20000 - 24999 | Strong democrat    | Protestant         | Southern baptist |     nil |

- count() でファクタ数の確認
gss_cat %>% count(race)
gss_cat %>% count(rincome)
gss_cat %>% count(partyid)
gss_cat %>% count(relig)
gss_cat %>% count(denom)
ggplot(gss_cat, aes(race)) + geom_bar()

* 参考リンク

- [[https://forcats.tidyverse.org/][公式サイト]]
- [[https://cran.r-project.org/web/packages/forcats/index.html][CRAN]]
- [[https://cran.r-project.org/web/packages/forcats/forcats.pdf][Reference Manual]]
- [[https://github.com/tidyverse/forcats][Github Repo]]
- [[http://www.flutterbys.com.au/stats/downloads/slides/figure/factors.pdf][Cheatsheet(PDF)]]
- [[https://r4ds.had.co.nz/][R for Data Science]]
- Vignette
  - [[https://cran.r-project.org/web/packages/forcats/vignettes/forcats.html][Introduction to forcats]]
- Blog
  - [[https://kazutan.github.io/kazutanR/forcats_test.html][{forcats}パッケージでカテゴリカル変数(factor型データ)をいじってみる@Kazutan.R]]
    
